{
   "pages": [
      {
         "name": "Home",
         "path": "/",
         "description": "Synoptic Project Home",
         "content": [
            "About Makers Valley",
            "Makers Valley is an informal name for a cluster of suburbs located on the eastern edge of inner-city Johannesburg. Stretching from New Doornfontein to Bezuidenhout Valley, the area includes Bertrams, Judith’s Paarl, Troyeville, and Lorentzville. Home to around 46,000 residents (as of 2020*), this historically under-resourced area is known for its cultural richness and community spirit. While it has faced challenges like urban decline and high unemployment, it is also a place of resilience and transformation.",
            "In recent years, Makers Valley has begun to experience signs of renewal, driven by the growing presence of social and creative enterprises. The name “Makers Valley” has been embraced by a community of local entrepreneurs, artists, artisans, designers, poets, urban gardeners, and youth leaders who live and work here. This vibrant community is building a strong identity rooted in creativity and collaborative placemaking, emerging as a hub for innovation, craft, and social impact.",
            "In Johannesburg water is distributed through a centralised pipe network to provide water to all taps in the area and is wholly reliant on pumps. Due to the reliance of the system on pumps, the water system is closely linked to the electricity distribution system which suffers from both scheduled (i.e. load shedding) and unscheduled power outages. The shutdown of water also exacerbates the deterioration of pipes due to the absence of water pressure to support them. The failure of systems and water cutoffs have left homes and businesses without water for up to three weeks.",
            "What we are doing to help",
            "MV waterworks aims to help Makers Valley, by connecting to the pipe network in Johanessburg, and using the water pressure data to display the neccessary information needed to notify the residents/local water companies who can solve the issues."
         ]
      },
      {
         "name": "About Us",
         "path": "/about.html",
         "description": "About Synoptic Project",
         "content": [
            "MV Waterworks is a community-focused project based in Makers Valley, Johannesburg. Our mission is to help monitor water pressure across different neighbourhoods to detect leaks early and reduce water waste.",
            "This platform allows users to check water pressure data from different locations and view historical pressure records.",
            "By sharing this information, we want to help the community spot problems early and fix them faster.",
            "The project is part of the Engineers Without Borders challenge. It focuses on solving real world problems with sustainable solutions. We're using what we've learned so far to create something useful and meaningful for the community.",
            "Our goal is not just to build a tool, but to support the community in identifying issues quicker and reducing long term damage from leaks and outages.",
            "Sustainability was also a key part of our planning. We considered energy usage, local technical skill levels, and how easily the system can be updated or improved in the future.",
            "Overall, MV Waterworks is about using simple technology to make a real difference for real people."
         ]
      },
      {
         "name": "Report",
         "path": "/report.html",
         "description": "",
         "content": [
            "Submit a Report",
            "Location",
            "Enter Location...",
            "Date",
            "Description",
            "Describe the problem...",
            "Submit Report"
         ]
      },
      {
         "name": "Sign Up",
         "path": "/signup.html",
         "description": "",
         "content": [
            "Sign Up To Our Newsletter",
            "Contact Form",
            "First Name",
            "Last Name",
            "Email",
            "Sign In",
            "Username",
            "Password",
            "Sign In - Template for V2", 
            "(For Government / Council Accounts)"
         ]
      },
      {
         "name": "Map",
         "path": "/map.html",
         "description": "Displaying Interactive Map",
         "content": [
           "Water Pressure Map",
           "Data Table:",
           "Location",
           "Reading's Timestamp",
           "Pressure (kPa)"
         ]
      },
      {
         "name": "History",
         "path": "/history.html",
         "description": "Showing past historical data",
         "content": [
            "Previously recorded water pressures",
            "Data Table:",
            "Location",
            "Reading's Timestamp",
            "Pressure (kPa)"
         ]
      }
   ]
}
